#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖``
<details><summary>Validation Output</summary>

```


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.template_file.cb_app: Reading...
data.template_file.cb_app: Read complete after 0s [id=523692535b4e0bf63adcba67ec75ce2591506eadf54e8fc71a449415f96f8972]
tls_private_key.bastion: Refreshing state... [id=161a6b5e631c819356fdc2c450325e1b82ac853c]
aws_codedeploy_app.application: Refreshing state... [id=e24dfba9-e70f-462d-82c3-31e4d10e40b5:application]
aws_alb_listener.front_end: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:listener/app/cb-load-balancer/3299f35155e5c578/9052c175fd7068ec]
aws_iam_role.ecs_task_role: Refreshing state... [id=role-name-task]
data.aws_secretsmanager_secret.github_token: Reading...
aws_key_pair.bastion_key_pair: Refreshing state... [id=bastion-key-test]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=role-name]
aws_vpc.main: Refreshing state... [id=vpc-034dd95974f394745]
aws_s3_bucket.tf-bucket: Refreshing state... [id=remote-state-acics]
aws_ssm_parameter.bastion_key_pair: Refreshing state... [id=/test/bastion/ssh-key]
aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:eu-west-1:802288441694:cluster/cb-cluster]
data.aws_iam_policy_document.ecs_auto_scale_role: Reading...
data.aws_iam_policy_document.ecs_auto_scale_role: Read complete after 0s [id=3468681342]
aws_iam_role.codebuild_service_role: Refreshing state... [id=codebuild-service-role]
data.aws_availability_zones.available: Reading...
aws_dynamodb_table.sbx_dynamodb: Refreshing state... [id=remote-state-lock-acics]
aws_s3_bucket.build_artifacts: Refreshing state... [id=my-build-artifacts-bucket-asics]
aws_iam_role.codedeploy_service_role: Refreshing state... [id=codedeploy-service-role]
data.aws_secretsmanager_secret.github_token: Read complete after 1s [id=arn:aws:secretsmanager:eu-west-1:802288441694:secret:GitHubToken-B89asN]
aws_iam_role_policy_attachment.task_s3: Refreshing state... [id=role-name-task-20240816090311029800000002]
aws_iam_role.ecs_auto_scale_role: Refreshing state... [id=myEcsAutoScaleRole]
data.aws_availability_zones.available: Read complete after 0s [id=eu-west-1]
aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment: Refreshing state... [id=role-name-20240816090311060400000003]
aws_ecs_task_definition.app: Refreshing state... [id=cb-app-task]
aws_iam_role_policy.codebuild_service_role_policy: Refreshing state... [id=codebuild-service-role:terraform-20240815121418521100000001]
data.aws_secretsmanager_secret_version.github_token_value: Reading...
aws_iam_role_policy.codedeploy_service_role_policy: Refreshing state... [id=codedeploy-service-role:terraform-20240815121418543900000002]
aws_iam_role_policy_attachment.ecs_auto_scale_role: Refreshing state... [id=myEcsAutoScaleRole-20240816090310994000000001]
data.aws_secretsmanager_secret_version.github_token_value: Read complete after 0s [id=arn:aws:secretsmanager:eu-west-1:802288441694:secret:GitHubToken-B89asN|AWSCURRENT]
aws_codebuild_source_credential.github_credential: Refreshing state... [id=arn:aws:codebuild:eu-west-1:802288441694:token/github]
aws_internet_gateway.gw: Refreshing state... [id=igw-0fb286c9a49c0be0d]
aws_subnet.public[1]: Refreshing state... [id=subnet-0fe80fa5495cb3632]
aws_subnet.private[0]: Refreshing state... [id=subnet-036a5e724b44fa8df]
aws_subnet.private[1]: Refreshing state... [id=subnet-0a15b82f75b3300cd]
aws_security_group.lb: Refreshing state... [id=sg-05b6da332a709d6c8]
aws_subnet.public[0]: Refreshing state... [id=subnet-048eedd36dc7ac201]
aws_alb_target_group.app: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/cb-target-group/52bcaeea8f5483a5]
aws_route.internet_access: Refreshing state... [id=r-rtb-026c0f34bf1cafc1e1080289494]
aws_security_group.ecs_tasks: Refreshing state... [id=sg-01c3cdcddfa347799]
aws_s3_bucket_public_access_block.sbx_bucket_pa: Refreshing state... [id=remote-state-acics]
aws_s3_bucket_server_side_encryption_configuration.sbx_bucket_sse: Refreshing state... [id=remote-state-acics]
aws_s3_bucket_versioning.sbx_bucket_vers: Refreshing state... [id=remote-state-acics]
aws_alb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:802288441694:loadbalancer/app/cb-load-balancer/3299f35155e5c578]
aws_codebuild_project.application_build: Refreshing state... [id=arn:aws:codebuild:eu-west-1:802288441694:project/application-build]
aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:eu-west-1:802288441694:service/cb-cluster/cb-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_alb_listener.app_listener will be created
  + resource "aws_alb_listener" "app_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:loadbalancer/app/cb-load-balancer/3299f35155e5c578"
      + port              = 3000
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/cb-target-group/52bcaeea8f5483a5"
          + type             = "forward"
        }
    }

  # aws_alb_listener.front_end will be destroyed
  # (because aws_alb_listener.front_end is not in configuration)
  - resource "aws_alb_listener" "front_end" {
      - arn               = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:listener/app/cb-load-balancer/3299f35155e5c578/9052c175fd7068ec" -> null
      - id                = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:listener/app/cb-load-balancer/3299f35155e5c578/9052c175fd7068ec" -> null
      - load_balancer_arn = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:loadbalancer/app/cb-load-balancer/3299f35155e5c578" -> null
      - port              = 3000 -> null
      - protocol          = "HTTP" -> null
      - tags              = {} -> null
      - tags_all          = {} -> null

      - default_action {
          - order            = 1 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:802288441694:targetgroup/cb-target-group/52bcaeea8f5483a5" -> null
          - type             = "forward" -> null
        }
    }

  # aws_codedeploy_deployment_group.deployment_group will be created
  + resource "aws_codedeploy_deployment_group" "deployment_group" {
      + app_name               = "application"
      + arn                    = (known after apply)
      + compute_platform       = (known after apply)
      + deployment_config_name = "CodeDeployDefault.ECSAllAtOnce"
      + deployment_group_id    = (known after apply)
      + deployment_group_name  = "deployment-group"
      + id                     = (known after apply)
      + service_role_arn       = "arn:aws:iam::802288441694:role/codedeploy-service-role"
      + tags_all               = (known after apply)

      + auto_rollback_configuration {
          + enabled = true
          + events  = [
              + "DEPLOYMENT_FAILURE",
            ]
        }

      + deployment_style {
          + deployment_option = "WITH_TRAFFIC_CONTROL"
          + deployment_type   = "IN_PLACE"
        }

      + ecs_service {
          + cluster_name = "cb-cluster"
          + service_name = "cb-service"
        }

      + load_balancer_info {
          + target_group_pair_info {
              + prod_traffic_route {
                  + listener_arns = (known after apply)
                }
              + target_group {
                  + name = "cb-target-group"
                }
            }
        }
    }

Plan: 2 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @mandicm223, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Workflow`*